# Start using pandas

In [1]:
# import libraries
import pandas as pd
print("current pandas version: %s" %pd.__version__)

current pandas version: 1.0.3

<img src="img/8.png" style="max-width: 500px; height: auto; "></img>

<p>To manually store data in a table, create a <span style="color:red">DataFrame</span>. When using a Python dictionary of lists, the dictionary keys will be used as column headers and the values in each list as columns of the <span style="color:red">DataFrame</span>.</p>

In [2]:
# Data store in a dictionary
data = {'name':['Pikachu', 'Charmender', 'Charmender', 'Psyduck'],
        'type':['electric', 'fire', 'fire', 'water'],
        'level':[320, 309, 309, 320]}

In [3]:
# Create a DataFrame
pd.DataFrame(data)

         name      type  level
0     Pikachu  electric    320
1  Charmender      fire    309
2  Charmender      fire    309
3     Psyduck     water    320

<p>Creating a DataFrame by passing a nested list, with a labeled columns:</p>

In [4]:
# Data store in a nested list
data1 = [['Pikachu', 'electric', 320],
         ['Charmender', 'fire', 309],
         ['Charmender', 'fire', 309],
         ['Psyduck', 'water', 320]]

In [5]:
# Create a DataFrame
df = pd.DataFrame(data, columns=['name','type','level'])
df

         name      type  level
0     Pikachu  electric    320
1  Charmender      fire    309
2  Charmender      fire    309
3     Psyduck     water    320

<img src="img/9.png" style="max-width: 500px; height: auto; "></img>

I’m interested in Pokemon's level

In [6]:
df['level']

0    320
1    309
2    309
3    320
Name: level, dtype: int64

In [7]:
# Check data type for df['level']
type(df['level'])

pandas.core.series.Series

In [8]:
# Check data type for df
type(df)

pandas.core.frame.DataFrame

Do something with a DataFrame or Series

In [9]:
# Q1. 我们可以如何计算小志一共拥有多少个不同的小精灵呢?
len(df['name'].unique())

3

In [10]:
# Q2. 我们可以如何计算小志每种不同的类型的小精灵拥有多少呢?
df['type'].value_counts()

fire        2
electric    1
water       1
Name: type, dtype: int64

In [11]:
# Q2b. 小志即将跟水系的精灵训练师battle，我们希望从我们的小精灵 里面找到所有的雷电系的进行作战，我们应该怎么做呢?
df[df['type']=='electric']

      name      type  level
0  Pikachu  electric    320

# Data Analysis on Marketing Dataset PART1

<img src="img/0.png" style="max-width: 400px; height: auto; "></img>

### Direct marketing

<p>There are two main approaches for enterprises to promote products and/or services: through <b>mass campaigns</b>, targeting general indiscriminate public or <b>targeted cmpaigns/direct marketing</b>, targeting a specific set of contacts.</p>

<p>Nowadays, in a global competitive world, positive responses to mass campaigns are typically very low, less
than <b>1%</b>. Alternatively, directed marketing focus on targets that assumable will be keener to that specific product/service, making this kind of campaigns more attractive due to its efficiency.</p>

### Direct marketing data

<p>We collected data from a Portuguese bank that used its own contact-center to do directed marketing campaigns. </p>
<p>The dataset collected is related to 17 campaigns that occurred between May 2008 and November 2010, corresponding to a total of 41188 customers (a customer can be contacted more than once). </p>
<p>During these phone campaigns, an attractive long-term deposit application, with good interest rates, was offered. For each contact, a large number of attributes was stored and if there was a success (the target variable). For the whole database considered, there were 4640
successes (11% success rate).</p>

##### Input variables:<br>
**- client data:**<br>
1 - cust_id : customer id<br>
2 - age (numeric)<br>
3 - job : type of job (categorical: 'admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed')<br>
4 - marital : marital status (categorical: 'divorced','married','single')<br>
5 - education (categorical: 'basic.4y','basic.6y','basic.9y','high.school','illiterate','professional.course','university.degree')<br>
6 - default: has credit in default? (categorical: 'no','yes')<br>
7 - mortgage: has housing loan? (categorical: 'no','yes')<br>
8 - loan: has personal loan? (categorical: 'no','yes')<br>
<br>
**- related with the last contact of the current campaign:**<br>
9 - contact_type: contact communication type (categorical: 'cellular','telephone')<br> 
10 - date: last contact date<br>
11 - duration: last contact duration, in seconds (numeric)<br>
<br>
**- other attributes:**<br>
12 - contact_num: number of contacts performed during this campaign and for this client (numeric, includes last contact)<br>
13 - p_days: number of days that passed by after the client was last contacted from a previous campaign (numeric; 999 means client was not previously contacted)<br>
14 - p_outcome: outcome of the previous marketing campaign (categorical: 'failure','nonexistent','success')<br>
<br>
##### Output variables:<br>
15 - y - has the client subscribed a term deposit? (binary: 'yes','no')

## Load dataset

In [12]:
# Read customer data (cust_v2.xlsx) to DataFrame
cust = pd.read_excel('./data/cust_v2.xlsx')

In [13]:
# Read contact data (contact_v2.csv) to DataFrame
contact = pd.read_csv('./data/contact_v2.csv')

## Data overview

In [14]:
# Check number of rows and columns
# row, record, observation
# column, variable, feature, 
print(cust.shape)
print(contact.shape)

(42188, 8)
(41188, 8)

In [15]:
print('customer table has %d rows and %d columns' %cust.shape)

customer table has 42188 rows and 8 columns

In [16]:
# Display first 5 rows
contact.head()

,cust_id,contact_type,duration,contact_num,p_days,p_outcome,y,date
0,44715,cellular,108,2,999,nonexistent,no,2008-08-02
1,62194,telephone,422,5,999,nonexistent,no,2008-06-03
2,25436,cellular,107,13,999,nonexistent,no,2008-07-16
3,39633,cellular,311,1,999,nonexistent,no,2008-07-15
4,92803,cellular,51,1,999,nonexistent,no,2008-11-09

In [17]:
# Display first row 
contact.head(1)

,cust_id,contact_type,duration,contact_num,p_days,p_outcome,y,date
0,44715,cellular,108,2,999,nonexistent,no,2008-08-02

In [18]:
# Display last 5 rows
cust.tail()

,cust_id,age,job,marital,education,default,mortgage,loan
42183,56044,32,blue-collar,single,basic.9y,no,yes,no
42184,24556,42,blue-collar,married,high.school,no,no,yes
42185,15097,54,technician,married,high.school,no,yes,no
42186,2365,37,technician,married,university.degree,no,no,no
42187,23349,40,blue-collar,married,basic.6y,unknown,yes,no

## Merge dataset together

<img src="img/left_join.png"></img>

In [19]:
# Join contact and customer data
cmpn = pd.merge(left=contact, right=cust, how='inner', on='cust_id')
cmpn.shape

(41188, 15)

In [20]:
# Change column order
col = ['cust_id','age','job','marital','education','default','mortgage','loan',
       'contact_type','date','duration','contact_num','p_days','p_outcome','y']
cmpn = cmpn[col]

In [21]:
cmpn.head()

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y
0,44715,52,blue-collar,married,basic.6y,unknown,yes,no,cellular,2008-08-02,108,2,999,nonexistent,no
1,62194,31,management,married,university.degree,no,yes,no,telephone,2008-06-03,422,5,999,nonexistent,no
2,25436,36,entrepreneur,married,university.degree,unknown,yes,no,cellular,2008-07-16,107,13,999,nonexistent,no
3,39633,44,blue-collar,married,basic.4y,no,yes,no,cellular,2008-07-15,311,1,999,nonexistent,no
4,92803,32,admin.,married,university.degree,no,yes,yes,cellular,2008-11-09,51,1,999,nonexistent,no

## Add missing to the dataset

In [22]:
import update

In [23]:
cmpn = update.update(df=cmpn) # run update function in update module(package) to add noise to the dataset

In [24]:
cmpn.shape

(41189, 15)

In [25]:
cmpn.tail()

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y
41184,24556,42.0,blue-collar,married,high.school,no,no,yes,telephone,2008-05-11,1297,3,999,nonexistent,yes
41185,15097,54.0,technician,married,high.school,no,yes,no,cellular,2009-04-26,178,5,999,nonexistent,no
41186,2365,37.0,technician,married,university.degree,no,no,no,cellular,2009-05-14,219,2,999,nonexistent,no
41187,23349,40.0,blue-collar,married,basic.6y,,yes,no,telephone,2009-04-20,534,1,999,nonexistent,no
41188,23349,40.0,blue-collar,married,basic.6y,,yes,no,telephone,2009-04-20,534,1,999,nonexistent,no

## How do I select a subset of a DataFrame?

#### How do I select specific columns from a DataFrame?

<img src="img/1.png" style="max-width: 500px; height: auto; "></img>

In [26]:
# I’m interested in the age of these customers.
ages = cmpn['age'] # cmpn.age

In [27]:
ages.head()

0    52.0
1    31.0
2    36.0
3    44.0
4    32.0
Name: age, dtype: float64

In [28]:
# As a single column is selected, the returned object is a Series
type(ages)

pandas.core.series.Series

In [29]:
# Series is 1-dimensional and only number of rows is returned
ages.shape

(41189,)

In [30]:
# I’m interested in customer's age and job.
age_job = cmpn[['age','job']]
# The inner square brackets define a Python list with column names, 
# whereas the outer brackets are used to select the data from a pandas DataFrame as seen in the previous example.

In [31]:
age_job.head()

    age           job
0  52.0   blue-collar
1  31.0    management
2  36.0  entrepreneur
3  44.0   blue-collar
4  32.0        admin.

In [32]:
# The returned data type is a pandas DataFrame:
type(age_job)

pandas.core.frame.DataFrame

In [33]:
# A DataFrame is 2-dimensional with both a row and column dimension.
age_job.shape
# The selection returned a DataFrame with 41189 rows and 2 columns.

(41189, 2)

#### How do I filter specific rows from a DataFrame?

<img src="img/2.png" style="max-width: 500px; height: auto; "></img>

In [34]:
# I’m interested in customers who are older than 35 years.
# To select rows based on a conditional expression, use a condition inside the selection brackets [].
above_35 = cmpn[cmpn.age > 35]

In [35]:
above_35.shape

(24382, 15)

In [36]:
above_35.head(2)

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y
0,44715,52.0,blue-collar,married,basic.6y,,yes,no,cellular,2008-08-02,108,2,999,nonexistent,no
2,25436,36.0,entrepreneur,married,university.degree,,yes,no,cellular,2008-07-16,107,13,999,nonexistent,no

In [37]:
# The output of the conditional expression is actually a Series of boolean values with the same 
# number of rows as the original DataFrame. Such a Series of boolean values can be used to filter 
# the DataFrame by putting it in between the selection brackets []. Only rows for which the value 
# is True will be selected.
(cmpn.age > 35).head()

0     True
1    False
2     True
3     True
4    False
Name: age, dtype: bool

In [38]:
(cmpn.age > 35).shape

(41189,)

In [39]:
(cmpn.age > 35).sum()

24382

In [40]:
# I’m interested in customers who are students or retired.
job_student_retired = cmpn[cmpn.job.isin(['student', 'retired'])]

In [41]:
job_student_retired.shape

(2595, 15)

In [42]:
job_student_retired.tail()

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y
41050,23717,31.0,student,single,university.degree,no,yes,no,cellular,2008-07-03,324,1,999,nonexistent,no
41059,9021,54.0,retired,divorced,professional.course,no,yes,no,telephone,2008-05-27,242,6,999,nonexistent,no
41061,28556,64.0,retired,married,NaN,no,yes,no,cellular,2009-08-28,171,3,999,failure,no
41112,36515,47.0,retired,married,basic.4y,,no,yes,telephone,2008-06-28,37,3,999,nonexistent,no
41171,62657,19.0,student,single,basic.4y,no,no,yes,cellular,2009-04-13,371,2,999,nonexistent,yes

In [43]:
# The above is equivalent to filtering by rows for which job is either student or retired 
# and combining the two statements with an | (or) operator:
job_student_retired2 = cmpn[(cmpn.job=='student') | (cmpn.job=='retired')]
job_student_retired2.shape

(2595, 15)

#### How do I select specific rows and columns from a DataFrame?

<img src="img/3.png" style="max-width: 500px; height: auto; "></img>

In [44]:
# I’m interested in job and education of customers who are older than 35 years
cust_35_job_edu = cmpn.loc[cmpn.age>35, ['job','education']]

In [45]:
cust_35_job_edu.shape

(24382, 2)

In [46]:
cust_35_job_edu.head()

            job          education
0   blue-collar           basic.6y
2  entrepreneur  university.degree
3   blue-collar           basic.4y
6      services        high.school
8       retired           basic.4y

#### I’m interested in rows 10 till 25 and columns 3 to 5.

In [47]:
cmpn.iloc[9:25, 2:5]

              job   marital            education
9      management   married             basic.4y
10       services   married          high.school
11     technician    single  professional.course
12         admin.    single    university.degree
13       services   married          high.school
14     management  divorced    university.degree
15  self-employed   married    university.degree
16  self-employed   married    university.degree
17     unemployed   married                  NaN
18         admin.  divorced          high.school
19     technician    single  professional.course
20     management   married    university.degree
21    blue-collar   married             basic.4y
22     management  divorced    university.degree
23        retired   married             basic.4y
24    blue-collar    single             basic.9y

## How to create new columns derived from existing columns?

<img src="img/4.png" style="max-width: 500px; height: auto; "></img>

In [48]:
# Convert duration from seconds to mins
cmpn['duration_mins'] = cmpn.duration / 60
# cmpn.duration_mins = cmpn.duration / 60 won't work!!!

In [49]:
cmpn.shape

(41189, 16)

In [50]:
cmpn.head(2)

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y,duration_mins
0,44715,52.0,blue-collar,married,basic.6y,,yes,no,cellular,2008-08-02,108,2,999,nonexistent,no,1.800000
1,62194,31.0,management,married,university.degree,no,yes,no,telephone,2008-06-03,422,5,999,nonexistent,no,7.033333

## How to calculate summary statistics?

#### Aggregating statistics

<img src="img/5.png" style="max-width: 500px; height: auto; "></img>

In [51]:
# What is the average duration?
cmpn.duration.mean()

258.29170409575374

In [52]:
# What is the median age and duration?
cmpn[['age','duration']].median()

age          38.0
duration    180.0
dtype: float64

In [53]:
cmpn[['age','duration']].describe()

                age      duration
count  40689.000000  41189.000000
mean      40.025068    258.291704
std       10.415083    259.279660
min       17.000000      0.000000
25%       32.000000    102.000000
50%       38.000000    180.000000
75%       47.000000    319.000000
max       98.000000   4918.000000

#### Aggregating statistics grouped by category

<img src="img/6.png" style="max-width: 500px; height: auto; "></img>

In [54]:
# What is the average duration by job?
cmpn.groupby('job').duration.mean()

job
                 239.675758
admin.           254.312128
blue-collar      264.571475
entrepreneur     263.267857
housemaid        250.454717
management       257.058140
retired          273.712209
self-employed    264.142153
services         258.398085
student          283.683429
technician       250.232241
unemployed       249.451677
Name: duration, dtype: float64

In [55]:
# What is the number of contacts for each education level?
cmpn.groupby('education').education.count()

education
basic.4y                4176
basic.6y                2293
basic.9y                6045
high.school             9515
illiterate                18
professional.course     5243
university.degree      12168
Name: education, dtype: int64

In [56]:
# A shortcut function of above operation
cmpn.education.value_counts()

university.degree      12168
high.school             9515
basic.9y                6045
professional.course     5243
basic.4y                4176
basic.6y                2293
illiterate                18
Name: education, dtype: int64

#### Pivot table

<img src="img/7.png" style="max-width: 500px; height: auto; "></img>

In [57]:
# What is the duration rate by job and y (subscribed a term deposit)?
import numpy as np
cmpn.pivot_table(values='duration', index='job', columns='y', aggfunc=np.mean, margins=True)

y                      no         yes         All
job
               204.582192  517.756757  239.802432
admin.         215.230905  517.030461  254.317040
blue-collar    229.752733  732.823899  264.402209
entrepreneur   225.841353  667.540323  263.510316
housemaid      217.986330  535.537736  249.831599
management     220.944380  543.804878  257.248200
retired        224.416862  420.235023  273.970845
self-employed  222.392744  622.020134  264.414255
services       225.158473  632.649068  258.267726
student        228.170284  401.288321  282.505155
technician     213.454470  553.299040  250.294126
unemployed     212.667051  471.451389  249.490119
All            220.857405  552.827609  258.256468

## How to handle time series data with ease?

#### Using pandas datetime properties

In [58]:
cmpn.dtypes

cust_id            int64
age              float64
job               object
marital           object
education         object
default           object
mortgage          object
loan              object
contact_type      object
date              object
duration           int64
contact_num        int64
p_days             int64
p_outcome         object
y                 object
duration_mins    float64
dtype: object

In [59]:
cmpn.loc[0,'date']

'2008-08-02'

In [60]:
type(cmpn.loc[0,'date'])

str

In [61]:
cmpn['date1'] = pd.to_datetime(cmpn.date)

In [62]:
cmpn.dtypes

cust_id                   int64
age                     float64
job                      object
marital                  object
education                object
default                  object
mortgage                 object
loan                     object
contact_type             object
date                     object
duration                  int64
contact_num               int64
p_days                    int64
p_outcome                object
y                        object
duration_mins           float64
date1            datetime64[ns]
dtype: object

In [63]:
cmpn.loc[0,'date1']

Timestamp('2008-08-02 00:00:00')

In [64]:
type(cmpn.loc[0,'date1'])

pandas._libs.tslibs.timestamps.Timestamp

#### Why are these pandas.Timestamp objects useful?

In [65]:
# Extract month
cmpn.date1.dt.month
# cmpn.date.dt.month doesn't work

0         8
1         6
2         7
3         7
4        11
         ..
41184     5
41185     4
41186     5
41187     4
41188     4
Name: date1, Length: 41189, dtype: int64

In [66]:
# Create year-month (yyyymm format) string column
cmpn['yrmth'] = cmpn.date1.dt.strftime('%Y%m')

In [67]:
cmpn.dtypes

cust_id                   int64
age                     float64
job                      object
marital                  object
education                object
default                  object
mortgage                 object
loan                     object
contact_type             object
date                     object
duration                  int64
contact_num               int64
p_days                    int64
p_outcome                object
y                        object
duration_mins           float64
date1            datetime64[ns]
yrmth                    object
dtype: object

In [68]:
cmpn.head(2)

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,date,duration,contact_num,p_days,p_outcome,y,duration_mins,date1,yrmth
0,44715,52.0,blue-collar,married,basic.6y,,yes,no,cellular,2008-08-02,108,2,999,nonexistent,no,1.800000,2008-08-02,200808
1,62194,31.0,management,married,university.degree,no,yes,no,telephone,2008-06-03,422,5,999,nonexistent,no,7.033333,2008-06-03,200806

In [69]:
cmpn.shape

(41189, 18)

In [70]:
# drop original date and rename date1 as date
cmpn = cmpn.drop(['date'], axis=1)
cmpn.shape

(41189, 17)

In [71]:
cmpn = cmpn.rename(columns={'date1':'date'})

In [72]:
cmpn.head(1)

,cust_id,age,job,marital,education,default,mortgage,loan,contact_type,duration,contact_num,p_days,p_outcome,y,duration_mins,date,yrmth
0,44715,52.0,blue-collar,married,basic.6y,,yes,no,cellular,108,2,999,nonexistent,no,1.8,2008-08-02,200808

## Output Data

In [73]:
# Save cmpn to .pkl file for part 2 use
# cmpn.to_pickle('./data/cmpn_part1.pkl')

In [74]:
# Save cmpn to .csv file for part 2 use
# cmpn.to_csv('./data/cmpn_part1.csv')